In [2]:
import pandas as pd
import numpy as np

In [19]:
df = pd.DataFrame({"Column_a" : [3,'?',2,5],
                   "Column_b" : ['*',4,5,6],
                   "Column_c" : ['+',3,2,'&'],
                   "Column_d" : [5,'?',7,'!']})
df

  Column_a Column_b Column_c Column_d
0        3        *        +        5
1        ?        4        3        ?
2        2        5        2        7
3        5        6        &        !

In [20]:
df.replace({'?':np.nan,'*':np.nan, '+':np.nan,'&':np.nan,'!':np.nan}, inplace = True)
df

   Column_a  Column_b  Column_c  Column_d
0       3.0       NaN       NaN       5.0
1       NaN       4.0       3.0       NaN
2       2.0       5.0       2.0       7.0
3       5.0       6.0       NaN       NaN

In [21]:
df.isna().any()

Column_a    True
Column_b    True
Column_c    True
Column_d    True
dtype: bool

In [22]:
df.isna().sum()

Column_a    1
Column_b    1
Column_c    2
Column_d    2
dtype: int64

In [23]:
df.dropna(axis = 0, how = 'any', inplace = False) #저장을 원치않는다. inplace의 defalut는 False이다

   Column_a  Column_b  Column_c  Column_d
2       2.0       5.0       2.0       7.0

In [24]:
df.dropna(axis = 0, how = 'all', inplace = False)

   Column_a  Column_b  Column_c  Column_d
0       3.0       NaN       NaN       5.0
1       NaN       4.0       3.0       NaN
2       2.0       5.0       2.0       7.0
3       5.0       6.0       NaN       NaN

In [25]:
 df.dropna(axis = 0, thresh = 1, inplace = False) #inplace = True로 하면 결과치 확인

   Column_a  Column_b  Column_c  Column_d
0       3.0       NaN       NaN       5.0
1       NaN       4.0       3.0       NaN
2       2.0       5.0       2.0       7.0
3       5.0       6.0       NaN       NaN

In [26]:
df.dropna(axis = 0, thresh = 2, inplace = False)

   Column_a  Column_b  Column_c  Column_d
0       3.0       NaN       NaN       5.0
1       NaN       4.0       3.0       NaN
2       2.0       5.0       2.0       7.0
3       5.0       6.0       NaN       NaN

In [27]:
df.fillna(100, inplace = False)

   Column_a  Column_b  Column_c  Column_d
0       3.0     100.0     100.0       5.0
1     100.0       4.0       3.0     100.0
2       2.0       5.0       2.0       7.0
3       5.0       6.0     100.0     100.0

In [28]:
mean = df['Column_a'].mean()
df['Column_a'].fillna(mean) #평균값 계산

0    3.000000
1    3.333333
2    2.000000
3    5.000000
Name: Column_a, dtype: float64

In [29]:
median = df['Column_a'].median()
df['Column_a'].fillna(median) #중간값 계산

0    3.0
1    3.0
2    2.0
3    5.0
Name: Column_a, dtype: float64

In [31]:
df.fillna(axis = 0, method = 'ffill') #axis = 0이면 세로 방향으로 채우기, axis = 1이면 가로 방향으로 채우기

   Column_a  Column_b  Column_c  Column_d
0       3.0       3.0       3.0       5.0
1       NaN       4.0       3.0       3.0
2       2.0       5.0       2.0       7.0
3       5.0       6.0       6.0       6.0

In [32]:
df.fillna(axis = 0, method = 'bfill')

   Column_a  Column_b  Column_c  Column_d
0       3.0       4.0       3.0       5.0
1       2.0       4.0       3.0       7.0
2       2.0       5.0       2.0       7.0
3       5.0       6.0       NaN       NaN